#!/usr/bin/python
# -*- coding: utf-8 -*-

import os

fundation_table_request= {
   '2013' : [u'證券代號', u'證券名稱', u'外資買進股數', u'外資賣出股數', u'投信買進股數', u'投信賣出股數', u'自營商買進股數', u'自營商賣出股數', u'三大法人買賣超股數' ] ,
   '2014' : [u'證券代號', u'證券名稱', u'外資買進股數', u'外資賣出股數', u'投信買進股數', u'投信賣出股數', u'自營商買進股數', u'自營商賣出股數', u'三大法人買賣超股數' ] ,
   '2015' : [u'證券代號', u'證券名稱', u'外資買進股數', u'外資賣出股數', u'投信買進股數', u'投信賣出股數', u'自營商買進股數(自行買賣)', u'自營商賣出股數(自行買賣)', u'三大法人買賣超股數' ] ,
   '2016' : [u'證券代號', u'證券名稱', u'外資買進股數', u'外資賣出股數', u'投信買進股數', u'投信賣出股數', u'自營商買進股數(自行買賣)', u'自營商賣出股數(自行買賣)', u'三大法人買賣超股數' ] ,
   '2017' : [u'證券代號', u'證券名稱', u'外資買進股數', u'外資賣出股數', u'投信買進股數', u'投信賣出股數', u'自營商買進股數(自行買賣)', u'自營商賣出股數(自行買賣)', u'三大法人買賣超股數' ] ,
   '2018' : [u'證券代號', u'證券名稱', u'外陸資買進股數(不含外資自營商)', u'外陸資賣出股數(不含外資自營商)',\
             u'投信買進股數', u'投信賣出股數', u'自營商買進股數(自行買賣)', u'自營商賣出股數(自行買賣)', u'三大法人買賣超股數'] ,}


balance_sheet = {
   1 : [u'資產負債表'],
   2 : [u'現金及約當現金'],
   3 : [u'應收票據淨額', u'應收帳款淨額', u'應收帳款－關係人淨額', u'其他應收款', u'其他應收款－關係人'], 
   4 : [u'存貨'],
   5 : [u'流動資產合計'],
   6 : [u'非流動負債合計'],
   7 : [u'負債總計'],
   8 : [u'普通股股本'],
   9 : [u'權益總額'],
   10 : [u'負債及權益總計'],
   }
   

cash_flow_sheet={
   1 : [u'綜合損益表'],
   2 : [u'營業收入合計'],
   3 : [u'營業成本合計'], 
   4 : [u'營業毛利（毛損）淨額'], 
   5 : [u'推銷費用', u'管理費用', u'研究發展費用', u'其他費用', u'營業費用合計'],
   6 : [u'營業利益（損失）'],
   7 : [u'營業外收入及支出合計'],
   8 : [u'所得稅費用（利益）合計'],
   9 : [u'本期淨利（淨損）'],
   10 : [u'稀釋每股盈餘合計'],
   }

income_statement_sheet={
   1 : [u'現金流量表'],
   2 : [u'營業活動之淨現金流入（流出）'],
   3 : [u'投資活動之淨現金流入（流出）'], 
   4 : [u'籌資活動之淨現金流入（流出）'], 
   5 : [u'匯率變動對現金及約當現金之影響'],
   6 : [u'本期現金及約當現金增加（減少）數'],
   7 : [u'期初現金及約當現金餘額'],
   8 : [u'期末現金及約當現金餘額'],
   9 : [u'資產負債表帳列之現金及約當現金'],
   }



def information():
   print (fundation_table_request["2013"][0])

if  __name__ == '__main__':
   #information()
   print balance_sheet
