#!/usr/bin/python
# -*- coding: utf-8 -*-

import os

fundation_table_request= {'2014' : ['證券代號', u'證券名稱', u'外資買進股數', u'外資賣出股數', u'投信買進股數', u'投信賣出股數', u'自營商買進股數', u'自營商賣出股數', u'三大法人買賣超股數' ] ,

                          '2015' : [u'證券代號', u'證券名稱', u'外資買進股數', u'外資賣出股數', u'投信買進股數', u'投信賣出股數', u'自營商買進股數(自行買賣)', u'自營商賣出股數(自行買賣)', u'三大法人買賣超股數' ] ,

                          '2016' : [u'證券代號', u'證券名稱', u'外資買進股數', u'外資賣出股數', u'投信買進股數', u'投信賣出股數', u'自營商買進股數(自行買賣)', u'自營商賣出股數(自行買賣)', u'三大法人買賣超股數' ] ,

                          '2017' : [u'證券代號', u'證券名稱', u'外資買進股數', u'外資賣出股數', u'投信買進股數', u'投信賣出股數', u'自營商買進股數(自行買賣)', u'自營商賣出股數(自行買賣)', u'三大法人買賣超股數' ] ,

                          '2018' : [u'證券代號', u'證券名稱', u'外陸資買進股數(不含外資自營商)', u'外陸資賣出股數(不含外資自營商)',\
                                    u'投信買進股數', u'投信賣出股數', u'自營商買進股數(自行買賣)', u'自營商賣出股數(自行買賣)', u'三大法人買賣超股數'] ,}



def information():
   print (fundation_table_request["2013"][0])

if  __name__ == '__main__':
   information()
